Revit 2026 API

# HorizontalAlign Enumeration

---

Horizontal alignment of model text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HorizontalAlign
```
```vb
Public Enumeration HorizontalAlign
```
```cpp
public enum class HorizontalAlign
```
```fsharp
type HorizontalAlign
```

| Member name | Value | Description |
| --- | --- | --- |
| Center | 128 |  |
| Left | 64 |  |
| Right | 256 |  |

#### Reference

Autodesk.Revit.DB Namespace